////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ
// 

// Процедура обработчик проведения документа
//
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Для Каждого ТекСтрокаСостав Из Состав Цикл
		// регистр УчетНоменклатуры Расход
		Если НЕ ТекСтрокаСостав.Номенклатура.Услуга Тогда
			Движение = Движения.УчетНоменклатуры.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаСостав.Номенклатура;
			Движение.Склад = Склад;
			Движение.Количество = ТекСтрокаСостав.Количество;
		КонецЕсли;
	КонецЦикла;
	Для Каждого ТекСтрокаСостав Из Состав Цикл
		// регистр Продажи 
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаСостав.Номенклатура;
		Движение.Контрагент = Контрагент;
		Движение.Количество = ТекСтрокаСостав.Количество;
		Движение.Сумма = ТекСтрокаСостав.Сумма;
	КонецЦикла;
	// записываем движения регистров
	Движения.УчетНоменклатуры.Записать();
	Движения.Продажи.Записать();
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
КонецПроцедуры // ОбработкаПроведения(Отказ, Режим)

