////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ
// 

Перем глАрхив экспорт;

// Процедура ПриНачалеРаботыСистемы
// 
Процедура ПриНачалеРаботыСистемы()
	
	// Вызываем форму приветствия
	Приветствие = Обработки.Приветствие.ПолучитьФорму();
	Приветствие.Открыть();
	
	// Иницилизация 1С:Архива // 
    Попытка
        ЗагрузитьВнешнююКомпоненту("ArcDocAddIn.dll");
        глАрхив = Новый ("AddIn.AddInExtension"); 
        //Компонента 1С:Архив загружена успешно.
    Исключение
        //Ошибка загрузки компоненты 1С:Архив
    КонецПопытки; 

КонецПроцедуры


