// Выполняет добавление нового пользователя на сервере 1С:Предприятия 
//
Процедура ЗаписатьПользователя(ПользовательИБ) Экспорт
	
	// Проверить наличие роли Администратор у добавляемого пользователя.
	РольАдминистратор = Метаданные.Роли.Администратор;
	Если ПользовательИБ.Роли.Содержит(РольАдминистратор) Тогда
		
		// Проверить у текущего пользователя наличие административных прав.
		Если РольДоступна(РольАдминистратор) Тогда
			
			// Выполнить запись нового пользователя.
			ПользовательИБ.Записать();
		иначе
			Сообщить("Отсутствуют административные права. Добавление нового пользователя не выполнено.");
		КонецЕсли;
		
	Иначе // у добавляемого пользователя нет роли Администратор
		
		// Проверить, что текущий пользователь обладает правами Менеджера или Администратора
		Если РольДоступна(РольАдминистратор) ИЛИ
			 РольДоступна(Метаданные.Роли.Менеджер) Тогда
			
			// Выполнить запись нового пользователя.
			ПользовательИБ.Записать();
			
		Иначе
			Сообщить("Недостаточно прав доступа для добавления пользователя.");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
