////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ
// 

// Процедура обработчик проведения документа
//
Процедура ОбработкаПроведения(Отказ, Режим)
	
	СформироватьДвиженияПриходнойНакладной(Ссылка);
	
КонецПроцедуры // ОбработкаПроведения(Отказ, Режим)

// Процедура обработчик отмены проведения документа
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	Движения.УчетНоменклатуры.Очистить();
	Движения.УчетНоменклатуры.Записать();
КонецПроцедуры

